In [3]:
import numpy as np
import pandas as pd

# Exercise 1:

### 1. Add the following DF:

In [5]:
df = pd.DataFrame({
'CustomerID': np.arange(1, 11),
'FirstName': ['John', 'Steve', 'Anna', 'Mike', 'Emily', 'Jake', 'Laura', 'Nick', 'Olivia',
'David'],
'LastName': ['Smith', 'Johnson', 'Williams', 'Jones', 'Brown', 'Davis', 'Miller',
'Wilson', 'Moore', 'Taylor'],
'Age': np.random.randint(25, 65, size=10),
'TotalPurchaseAmount': np.random.randint(100, 1000, size=10)
})

In [7]:
print (df)

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount
0           1      John     Smith   25                  530
1           2     Steve   Johnson   28                  795
2           3      Anna  Williams   37                  468
3           4      Mike     Jones   32                  747
4           5     Emily     Brown   38                  899
5           6      Jake     Davis   34                  356
6           7     Laura    Miller   48                  968
7           8      Nick    Wilson   26                  823
8           9    Olivia     Moore   60                  308
9          10     David    Taylor   63                  532

## 2. Add the 'classification' column to the table, in which TotalPurchaseAmount that lower than 500 will show as 'low', and otherwise will show as 'High'

In [36]:
df['Classification'] = df['TotalPurchaseAmount'].apply(lambda amount: 'Low' if amount<500 else 'High')
print(df)

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount Classification
0           1      John     Smith   25                  530           High
1           2     Steve   Johnson   28                  795           High
2           3      Anna  Williams   37                  468            Low
3           4      Mike     Jones   32                  747           High
4           5     Emily     Brown   38                  899           High
5           6      Jake     Davis   34                  356            Low
6           7     Laura    Miller   48                  968           High
7           8      Nick    Wilson   26                  823           High
8           9    Olivia     Moore   60                  308            Low
9          10     David    Taylor   63                  532           High

### 3. Use the 'classification' column to create 'classification_by_age' and put values according to the following logic:
#### If the classification ‘Low’ and the customer age is below 20 put ‘Low_Young’
#### If the classification ‘HIGH’’ and the customer age is above 20 put ‘HIGH_Old’
#### If the classification ‘Low’ and the customer age is above 20 put ‘Low_Old’
#### If the classification ‘High’ and the customer age is below 20 put ‘High_Young’

In [210]:
def classification_by_age (row):
        if row['Classification'] == 'Low' and row['Age'] <= 20:
            return 'Low_Young'
        elif row['Classification'] == 'HIGH' and row['Age'] > 20:
            return 'HIGH_Old'
        elif row['Classification'] == 'Low' and row['Age'] > 20:
            return 'Low_Old'
        else:
            return 'High_Young'

In [218]:
df['classification_by_age']= df.apply(classification_by_age,axis=1)

In [220]:
print(df)

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount Classification  \
0           1      John     Smith   25                  530           High
1           2     Steve   Johnson   28                  795           High
2           3      Anna  Williams   37                  468            Low
3           4      Mike     Jones   32                  747           High
4           5     Emily     Brown   38                  899           High
5           6      Jake     Davis   34                  356            Low
6           7     Laura    Miller   48                  968           High
7           8      Nick    Wilson   26                  823           High
8           9    Olivia     Moore   60                  308            Low
9          10     David    Taylor   63                  532           High

  classification_by_age
0            High_Young
1            High_Young
2               Low_Old
3            High_Young
4            High_Young
5               Low_Old
6            High_Young
7            High_Young
8               Low_Old
9            High_Young

# Exercise 2:

## 1. Use the df from the previous exercise

In [227]:
print(df)

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount Classification  \
0           1      John     Smith   25                  530           High
1           2     Steve   Johnson   28                  795           High
2           3      Anna  Williams   37                  468            Low
3           4      Mike     Jones   32                  747           High
4           5     Emily     Brown   38                  899           High
5           6      Jake     Davis   34                  356            Low
6           7     Laura    Miller   48                  968           High
7           8      Nick    Wilson   26                  823           High
8           9    Olivia     Moore   60                  308            Low
9          10     David    Taylor   63                  532           High

  classification_by_age
0            High_Young
1            High_Young
2               Low_Old
3            High_Young
4            High_Young
5               Low_Old
6            High_Young
7            High_Young
8               Low_Old
9            High_Young

## 2. Sort the DataFrame by the customer name from A-Z order

In [248]:
print(df.sort_values(['FirstName','LastName'],ascending=[True,True]))

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount Classification  \
2           3      Anna  Williams   37                  468            Low
9          10     David    Taylor   63                  532           High
4           5     Emily     Brown   38                  899           High
5           6      Jake     Davis   34                  356            Low
0           1      John     Smith   25                  530           High
6           7     Laura    Miller   48                  968           High
3           4      Mike     Jones   32                  747           High
7           8      Nick    Wilson   26                  823           High
8           9    Olivia     Moore   60                  308            Low
1           2     Steve   Johnson   28                  795           High

  classification_by_age
2               Low_Old
9            High_Young
4            High_Young
5               Low_Old
0            High_Young
6            High_Young
3            High_Young
7            High_Young
8               Low_Old
1            High_Young

## 3. Sort the DataFrame first by `TotalPurchaseAmount` in ascending order, and then by `Age` in descending order for rows having the same 'TotalPurchaseAmount'.

In [258]:
print(df.sort_values(['TotalPurchaseAmount','Age'], ascending= [True,False]))

   CustomerID FirstName  LastName  Age  TotalPurchaseAmount Classification  \
8           9    Olivia     Moore   60                  308            Low
5           6      Jake     Davis   34                  356            Low
2           3      Anna  Williams   37                  468            Low
0           1      John     Smith   25                  530           High
9          10     David    Taylor   63                  532           High
3           4      Mike     Jones   32                  747           High
1           2     Steve   Johnson   28                  795           High
7           8      Nick    Wilson   26                  823           High
4           5     Emily     Brown   38                  899           High
6           7     Laura    Miller   48                  968           High

  classification_by_age
8               Low_Old
5               Low_Old
2               Low_Old
0            High_Young
9            High_Young
3            High_Young
1            High_Young
7            High_Young
4            High_Young
6            High_Young

# Exercise 3:

## 1. Run the following code to create the df:

In [299]:
np.random.seed(100)
df = pd.DataFrame(np.random.randint(0,100,size=(20, 10)),
columns=list('ABCDEFGHIJ'))
n_rows, n_cols = df.shape
row_idx = np.random.randint(0, n_rows)
col_idxs = np.random.choice(n_cols, size=n_cols//2, replace=False)
df.iloc[row_idx, col_idxs] = np.nan
n_nan_remaining = 15 - len(col_idxs)
row_idxs = np.random.randint(0, n_rows, size=n_nan_remaining)
col_idxs = np.random.randint(0, n_cols, size=n_nan_remaining)
df.iloc[row_idxs, col_idxs] = np.nan

## 2. In any exercise create a copy from the original df

In [302]:
print(df)

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
1    NaN  66  98   NaN   NaN   NaN   NaN   NaN   NaN  16.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
5    NaN  30  48   NaN   NaN   NaN   NaN   NaN   NaN  56.0
6    NaN  53  74   NaN   NaN   NaN   NaN   NaN   NaN  68.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
10   NaN  95  76   NaN   NaN   NaN   NaN   NaN   NaN  98.0
11   NaN  53  68   NaN   NaN   NaN   NaN   NaN   NaN  48.0
12   NaN  25  54   NaN   NaN   NaN   NaN   NaN   NaN  30.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0
16   NaN  66  16   NaN   NaN   NaN   NaN   NaN   NaN  78.0
17   NaN  77  84   NaN   NaN   NaN   NaN   NaN   NaN  93.0
18   NaN  28  82   NaN   NaN   NaN   NaN   NaN   NaN   NaN
19   NaN  90  93   NaN   NaN   NaN   NaN   NaN   NaN  37.0

## 3. Drop all the rows containing any NaN values

In [305]:
print(df.dropna(axis=0))

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0

## 4. Fill the NaN values using a random value between 0-100

In [312]:
print(df.fillna(np.random.randint(0,100)))

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
1   94.0  66  98  94.0  94.0  94.0  94.0  94.0  94.0  16.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
5   94.0  30  48  94.0  94.0  94.0  94.0  94.0  94.0  56.0
6   94.0  53  74  94.0  94.0  94.0  94.0  94.0  94.0  68.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
10  94.0  95  76  94.0  94.0  94.0  94.0  94.0  94.0  98.0
11  94.0  53  68  94.0  94.0  94.0  94.0  94.0  94.0  48.0
12  94.0  25  54  94.0  94.0  94.0  94.0  94.0  94.0  30.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0
16  94.0  66  16  94.0  94.0  94.0  94.0  94.0  94.0  78.0
17  94.0  77  84  94.0  94.0  94.0  94.0  94.0  94.0  93.0
18  94.0  28  82  94.0  94.0  94.0  94.0  94.0  94.0  94.0
19  94.0  90  93  94.0  94.0  94.0  94.0  94.0  94.0  37.0

## 5. Fill the NaN values in the C and D columns with the mean value of the columns

In [347]:
means = df[['C','D']].mean()
print(df.fillna(means))

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
1    NaN  66  98  53.2  64.2   NaN   NaN   NaN   NaN  16.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
5    NaN  30  48  53.2  64.2   NaN   NaN   NaN   NaN  56.0
6    NaN  53  74  53.2  64.2   NaN   NaN   NaN   NaN  68.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
10   NaN  95  76  53.2  64.2   NaN   NaN   NaN   NaN  98.0
11   NaN  53  68  53.2  64.2   NaN   NaN   NaN   NaN  48.0
12   NaN  25  54  53.2  64.2   NaN   NaN   NaN   NaN  30.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0
16   NaN  66  16  53.2  64.2   NaN   NaN   NaN   NaN  78.0
17   NaN  77  84  53.2  64.2   NaN   NaN   NaN   NaN  93.0
18   NaN  28  82  53.2  64.2   NaN   NaN   NaN   NaN   NaN
19   NaN  90  93  53.2  64.2   NaN   NaN   NaN   NaN  37.0

## Drop the NaN values for all columns with at least 2 NaN’s in all columns beside
the ‘D’ column

In [442]:
keep = ['D']
keep += df.columns[df.isna().sum()<2].tolist()
print(df[keep])

       D   B   C     J
0   87.0  24  67  98.0
1    NaN  66  98  16.0
2    2.0  93  86  83.0
3   67.0  91  59  14.0
4    2.0  71  80  27.0
5    NaN  30  48  56.0
6    NaN  53  74  68.0
7   83.0  91  91  76.0
8   84.0  70   3  48.0
9    5.0  43  36  42.0
10   NaN  95  76  98.0
11   NaN  53  68  48.0
12   NaN  25  54  30.0
13  17.0  24  55  12.0
14  92.0  82  67  72.0
15  93.0  12  18  54.0
16   NaN  66  16  78.0
17   NaN  77  84  93.0
18   NaN  28  82   NaN
19   NaN  90  93  37.0

In [560]:
print(df)
df.apply(lambda col: col.dropna() if col.isna().sum()>1  and not 'D'else col)

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
1    NaN  66  98   NaN   NaN   NaN   NaN   NaN   NaN  16.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
5    NaN  30  48   NaN   NaN   NaN   NaN   NaN   NaN  56.0
6    NaN  53  74   NaN   NaN   NaN   NaN   NaN   NaN  68.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
10   NaN  95  76   NaN   NaN   NaN   NaN   NaN   NaN  98.0
11   NaN  53  68   NaN   NaN   NaN   NaN   NaN   NaN  48.0
12   NaN  25  54   NaN   NaN   NaN   NaN   NaN   NaN  30.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0
16   NaN  66  16   NaN   NaN   NaN   NaN   NaN   NaN  78.0
17   NaN  77  84   NaN   NaN   NaN   NaN   NaN   NaN  93.0
18   NaN  28  82   NaN   NaN   NaN   NaN   NaN   NaN   NaN
19   NaN  90  93   NaN   NaN   NaN   NaN   NaN   NaN  37.0

       A   B   C     D     E     F     G     H     I     J
0    8.0  24  67  87.0  79.0  48.0  10.0  94.0  52.0  98.0
1    NaN  66  98   NaN   NaN   NaN   NaN   NaN   NaN  16.0
2    9.0  93  86   2.0  27.0   4.0  31.0   1.0  13.0  83.0
3    4.0  91  59  67.0   7.0  49.0  47.0  65.0  61.0  14.0
4   55.0  71  80   2.0  94.0  19.0  98.0  63.0  53.0  27.0
5    NaN  30  48   NaN   NaN   NaN   NaN   NaN   NaN  56.0
6    NaN  53  74   NaN   NaN   NaN   NaN   NaN   NaN  68.0
7   50.0  91  91  83.0  53.0  78.0   0.0  13.0  57.0  76.0
8    3.0  70   3  84.0  79.0  10.0  87.0  60.0   3.0  48.0
9   52.0  43  36   5.0  71.0  38.0  86.0  94.0  98.0  42.0
10   NaN  95  76   NaN   NaN   NaN   NaN   NaN   NaN  98.0
11   NaN  53  68   NaN   NaN   NaN   NaN   NaN   NaN  48.0
12   NaN  25  54   NaN   NaN   NaN   NaN   NaN   NaN  30.0
13  66.0  24  55  17.0  45.0  89.0  45.0  35.0  16.0  12.0
14  86.0  82  67  92.0  95.0  20.0  10.0   8.0  89.0  72.0
15  30.0  12  18  93.0  92.0  44.0  57.0   0.0  73.0  54.0
16   NaN  66  16   NaN   NaN   NaN   NaN   NaN   NaN  78.0
17   NaN  77  84   NaN   NaN   NaN   NaN   NaN   NaN  93.0
18   NaN  28  82   NaN   NaN   NaN   NaN   NaN   NaN   NaN
19   NaN  90  93   NaN   NaN   NaN   NaN   NaN   NaN  37.0